<template>
    <div class="container">
        <p class="title">
            弹性K线APP软件许可及服务协议
        </p>
        <section>
            <p class="sub-title">
                使用前请仔细阅读以下须知：
            </p>
            <div class="indent">
                本《软件许可及服务协议》（以下简称“本协议”）是您（个人或单一法人或
                单一非法人单位）与弹性K线APP(以下简称“本产品”）的软件著作权所有人武汉富
                水数据技术有限公司（以下简称“我司”）之间的法律协议。任何与本协议有关的计算
                机软件、电子文档，以及可能包括的短信、邮件、视频等其它形式的相关材料等都应是
                按本协议的条款而授予您的，同时本协议亦适用于任何有关本产品的后期发行和升级。
            </div>
            <div class="indent">
                《弹性K线APP用户隐私政策协议》为本协议不可分割的一部分，请您在使用
                本产品前认真阅读、充分理解本协议及《弹性K线APP用户隐私政策协议》各条款，
                尤其是其中与您权益具有或可能具有重大关系的条款，及可能免除或限制本服务运营方
                责任的条款。请您审阅并选择接受或不接受本协议及《弹性K线APP用户隐私政策协
                议》（未成年人应在法定监护人陪同下审阅），如您对本协议或《弹性K线APP用户
                隐私政策协议》的内容或页面提示信息有疑问，请勿勾选同意。如您在页面点击确认即
                表示您已充分阅读、理解并同意本协议及《弹性K线APP用户隐私政策协议》。除非
                您接受本协议及《弹性K线APP用户隐私政策协议》相关条款，否则您不应当购买、
                下载、安装或使用本产品及其相关服务。
            </div>
            <div class="indent">
                本产品及其相关服务仅供个人用户用于非商业环境及非盈利活动。未经我司授
                权，任何用于商业用途的拷贝、销售、转让、出租、修改本产品的行为均被认为是侵权
                行为。
            </div>
        </section>

        <section>
            <p class="sub-title">
                产品许可协议：
            </p>
            <div class="indent">
                <p class="bold">
                    1、知识产权声明：
                </p>
            </div>
            <div class="indent">
                1.1本产品由我司享有软件著作权，本产品及其相关服务包含的任何内容及与本
                产品相关的任何信息内容的知识产权，包括但不限于专利权、商标权、著作权、商业秘
                密等，如文字表述及其组合、UI、图片、音频、视频、商标、图标图饰、界面设计、版
                面框架、有关数据、印刷材料、电子文档等，均甶我司依法拥有或经许可享有使用权或
                可不经许可享有使用权，均受我国相关知识产权和国际知识产权条约以及其他知识产权
                法律法规的保护，但第三方服务或相关权利人依照法律规定应享有的权利除外。
            </div>
            <div class="indent">
                1.2除本协议所提供的明确书面许可，未经我司或授权我司依法享有使用权的权
                利人、或相关权利人事先书面同意外，拥有或使用本产品并不赋予您任何有关这些专利、
                商标、著作权、商业秘密或其它知识产权的许可。您不得为任何营利性或非营利性目的
                自行实施、利用、转让或许可任何第三方实施、利用、转让上述知识产权。
            </div>
            <div class="indent">
                1.3本产品和本服务包含或提供的图标、按钮、服务名称等均为我司或授权我司
                依法享有使用权的权利人依法享有的商标或商业标识，相关权利人依照法律规定应享有
                的权利除外。
            </div>
        </section>

        <section>
            <div class="indent">
                <p class="bold">
                    2、关于本产品服务
                </p>
                <p class="bold">
                    本产品向您提供期货投资相关的开户、交易、资讯、行情、投资者教育等服务，
                    具体以软件实际上线服务为准。
                </p>
            </div>
        </section>

        <section>
            <div class="indent">
                <p class="bold">
                    3、本产品授权范围
                </p>
            </div>
            <div class="indent">
                3.1在您接受并遵守本协议的前提下，我司授予您一项个人、不可转让及非排他
                性的许可以使用本产品。对每份许可协议，您仅可以个人使用本服务为目的在一台移动
                电子设备上安装、使用、显示、运行本产品。
            </div>
            <div class="indent">
                3.2您可以为使用本产品及服务的目的复制本产品的一个副本仅作为备份。备份
                副本必须包含本产品中含有的所有知识产权信息。
            </div>
            <div class="indent">
                3.3本产品可能提供包括但不限于ios、Android等多个应用版本，您应当选择
                与所安装终端设备相匹配的软件版本。如您因安装与您终端设备不匹配的版本而造成的
                任何损失，由您自行承担。
            </div>
            <div class="indent">
                3.4保留权利：本协议未明示授权的其他一切权利仍归我司所有，您在使用其他
                权利时须另外取得我司的书面同意。
            </div>
            <div class="indent">
                3.5除本协议有明确规定外，本协议并未对本产品以外我司向您提供的其他服务
                的服务条款进行约定。前述服务可能存在单独的服务条款，请您在使用有关服务时另行
                了解与确认。如用户使用该服务，视为对相关服务条款的接受。
            </div>
        </section>

        <section>
            <div class="indent">
                <p class="bold">
                    4、用户使用须知
                </p>
            </div>
            <div class="indent">
                4.1您应保证注册登记产品时提供的资料真实无误，甶此产生的后果由您自行承
                担。
            </div>
            <div class="indent">
                4.2您在遵守法律及本协议的前提下可依据本协议使用本产品。您无权实施下列
                行为，包括但不限于：
            </div>
            <div class="indent">
                4.2.1您不得对本产品运行的指令、数据进行修改，增减或变动产品的功能或运
                行效果，或将上述经改动后的产品或方法投入运营或无论是否以商业用途为目的向公众
                传播；
            </div>
            <div class="indent">
                4.2.2您不得擅自使用、修改、链接、复制、公开传播、散布、发行或公开发表
                本产品和本服务的任何程序或内容，或对本产品进行反向工程、反向汇编、反向编译等，
                或将本产品或本产品某一组成部分嵌入其他软件或服务，或将本产品或本产品某一组成
                部分进行汇编或建立镜像站点等；
            </div>
            <div class="indent">
                4.2.3对本产品或本产品运行过程中释放到任何终端内存中的数据、本产品运行
                过程中客户端与服务端的交互数据，以及本产品运行所必须的系统数据，包括但不限于
                代码、图像、文字等相关信息，您不得擅自实施包括但不限于下列行为：进行使用、复
                制、修改、链接、转载、汇编、发表、出版，建立镜像站点、擅自借助本产品发展与之
                有关的衍生产品、作品、服务等，形式包括但不限于使用软件、插件、外挂或非经合法
                授权的第三方工具或服务接入本产品及其相关系统；
            </div>
            <div class="indent">
                4.2.4您不得以本产品为基础，通过非官方开发、授权的软件、插件、外挂、或
                非经合法授权的其他工具/服务使用本服务，或制作、发布、传播非官方开发、授权的
                软件、插件、外挂、或非经合法授权的其他工具/服务；
            </div>
            <div class="indent">
                4.2.5您不得自行或允许第三方通过非官方程序、机器、脚本、爬虫、或其他自
                动化的方法使用本产品或获取本服务相关数据。您仅可通过本人人工操作的方式来使用
                本产品；
            </div>
            <div class="indent">
                4.2.6您不得利用本产品发表、传播、储存违反国家法律、危害国家安全、祖国
                统一、社会稳定的内容，或侮辱、诽谤、淫秽色情、暴力等任何违反国家法律法规政策
                的不当内容；
            </div>
            <div class="indent">
                4.2.7您不得利用本产品发表、传播、储存侵害他人个人隐私、知识产权、商业
                秘密权等合法权利的内容。
            </div>
            <div class="indent">
                4.3您可以使用您设置的本产品<span class="fb">登录名及密码、FacelD、手势、指纹方式登录
                    本产品。在本产品内使用具体服务或功能时，请您遵守相关的协议。您在使用之前请仔
                    细阅读相关协议、须知和规则内容，如您对前述内容有疑问，请勿进行后续操作，您使
                    用前述服务或功能，即表示您理解并接受相关的协议、须知和规则。</span>
            </div>
            <div class="indent">
                4.4请您理解，为了满足您多样化的需求，向您提供更好的服务，您同意我司在
                经营策略调整时，可以将本协议下的部分或全部服务转交我司的关联主体运营或履行。
                在我司发生合并、分立、收购、资产转让时，我司也可向第三方转让本服务下的相关资
                产和义务。
            </div>
            <div class="indent">
                4.5使用本产品必须遵守国家有关法律和政策，维护国家利益，保护国家安全，
                <span class="fb">对于您违法或违反本协议的使用而引起的一切责任甶您自行承担，导致我司损失的，我
                    司将保留向您要求赔偿，立即停止向您提供服务并保留相关记录，配合司法机关追究相
                    关法律责任的权利。</span>
            </div>
            <div class="indent">
                4.6我司充分尊重您个人信息的保护，介绍了您在使用本产品时，个人信息将会
                如何被处理，我司将按照相关法律法规严格保护您的个人信息。 <span class="fb">在您使用本产品前，请
                    您确认您已确认并同意上述内容。</span>
            </div>
            <div class="indent">
                4.7本产品<span class="fb">同大多数管理系统一样，可能受到各种安全问题和不可抗力事件的侵
                    扰。如黑客攻击、病毒感染、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电
                    力故障、政府行为等，威胁到您计算机信息和数据的安全，继而影响本产品的正常使用。</span>
                我们已建立相关内控制度，当发生信息安全事件后，我们将按照法律法规要求，立即采
                取补救措施，并以例如邮件、信函、电话等您预留的联系方式或推送通知的方式及时向
                您告知信息安全事件基本情况、范围影响、已采取或即将采取的补救措施、自主防范降
                低风险建议等内容，因特殊情况难以逐一告知您时，我们会采取合理、有效的方式及时
                发布公告。<span class="fb">您同时应加强信息安全意识，注意采用加强密码保护、使用合法杀毒软件等
                    方式合理使用本产品，以免遭致损失。</span>
            </div>
            <div class="indent">
                4.8您可以从我司的<span class="fb">官方网站或通过我司授权的合法第三方平台（如苹果商店、
                    华为应用商店等手机应用商店）获取本产品。</span>如您通过未经我司或我司合法授权的第三
                方获取、下载、安装本产品或获取与本产品名称相同或相似的其他产品，可能导致不可
                预知的风险，我司不对该产品负责，由此产生的一切法律责任与纠纷甶您自行承担。
            </div>
            <div class="indent">
                4.9<span class="fb">我司保留在任何时候为您提供本产品的修改、升级版本的权利，以及为修改
                    或升级服务向您收取费用的权利。</span>
            </div>
            <div class="indent">
                4.10<span class="fb">投资有风险，入市须谨慎。</span>本产品中的<span class="fb">所有图表、数据、信息以及经过整
                    理分析后的各种统计结果</span>等，仅供您参考，且不代表任何投资建议。因不同产品在图表、
                数据、信息、统计结果分析处理上所使用算法、显示方式的差异性，在此前提下，<span class="fb">您应
                    当认可您的操作结果，并承担您在操作过程中因上述差异而产生的操作风险。您因此而
                    遭受的经济损失，甶您自行承担</span>。产品中所提供的所有资讯、数据和所有相关内容，包
                括但不限于财经资讯、金融数据以及其他信息，仅供个人作为信息参考，并无作为投资
                依据之意图，也不构成任何投资建议或对价格涨跌或市场走势的确定性判断。<span class="fb">我司对于
                    本产品内容可能出现的错误、不完整、延迟提供以及依赖上述内容所采取之行动，不承
                    担任何法律责任</span>。
            </div>
            <div class="indent">
                4.11本产品所使用各类行情或资讯数据均经过相关交易所或第三方发布机构授
                权，您仅可以通过我司及我司关联公司著作权所有的APP、网站及其他合法行情终端查
                看相关行情或资讯数据，您使用我司及我司关联公司提供的行情资讯软件之前须先取得
                软件使用授权。您不得通过各种非法技术手段获取行情源数据并将之用于商业用途。交
                易所或合法第三方发布机构另有特别使用约定的，从其约定。
            </div>
            <div class="indent">
                4.12<span class="fb">您使用本产品过程中所产生的数据流量费甶当地运营商收取，具体收费标
                    准请与当地运营商联系，因此而产生的纠纷与我司无关</span>。
            </div>
        </section>

        <section>
            <div class="indent">
                <p class="bold">
                    5、法律责任与免责
                </p>
            </div>
            <div class="indent">
                5.1我司特别提请您注意，为了保障我司业务发展和调整的自主权以及您的使用
                体验，<span class="fb"> 我司拥有修改或中断产品授权的权利，修改或中断会以通告形式通知您</span>。
            </div>
            <div class="indent">
                5.2如您违反本协议或相关的服务条款的规定，我司有权根据您的行为性质采取
                <span class="fb">包括但不限于中断使用许可、停止提供服务、限制使用、追究法律责任等措施。同时，
                    我司会依据监管机构或司法部门的要求，协助其对您展幵调查</span>。
            </div>
            <div class="indent">
                5.3我司<span class="fb">免于在提供本产品及其服务过程中因数据和信息传输障碍，数据准确
                    性、有效性和及时性障碍，因第三方造成的通讯线路障碍，或不可抗力等其他原因产生
                    的责任</span>。
            </div>
            <div class="indent">
                5.4由于本产品及“产品”中所有数据和信息的传输都涉及到互联网服务因素，
                可能会受到各个环节不稳定因素的影响，存在<span class="fb">因不可抗力、计算机病毒、黑客攻击、系
                    统不稳定、您所在位置、交易所特殊数据服务中断、您关机以及其他任何网络、技术、
                    通信线路等原因造成的服务中断或不能满足您要求的风险，您须明白并自行承担以上风
                    险，在适用法律允许的最大范围内，我司在任何情况下不就因使用或不能使用本产品产
                    品及所发生的特殊的、意外的、直接或间接的损失承担赔偿责任</span>。
            </div>
            <div class="indent">
                5.5甶于本产品及“产品”中所有数据和信息的来源涉及到多方提供、处理、传
                输的环节，<span class="fb">本产品力求审慎但不保证数据的准确性、有效性和及时性，仅供参考。本产
                    品不对因“产品”数据和信息中全部或部分内容引致的任何损失承担任何责任</span>。
            </div>
            <div class="indent">
                5.6您因<span class="fb">第三方如电信部门的通讯线路故障、技术问题、网络、电脑故障、系统
                    不稳定性及其他各种不可抗力原因而遭受的经济损失，我司不承担责任</span>。
            </div>
            <div class="indent">
                5.7因<span class="fb">技术故障</span>等不可抗事件影响到服务的正常运行的，<span class="fb">我司承诺在第一时间内
                    与相关单位配合及时处理进行修复，但您因此而遭受的经济损失，我司不承担责任</span>。
            </div>
            <div class="indent">
                5.8如发生以上情况，造成本产品或服务暂时不可用的，<span class="fb">您可以使用我公司官网
                    推荐的其他期货资讯及交易软件</span>。
            </div>
            <div class="indent">
                5.9<span class="fb">如涉及收费功能，以具体功能对应的服务内免责条款为准</span>。
            </div>
        </section>

        <section>
            <div class="indent">
                <p class="bold">
                    6、其他条款
                </p>
            </div>
            <div class="indent">
                6.1为了向您提供更好的服务，我司将<span class="fb">定时或不定时优化和更新本产品和本服
                    务，本协议的内容也可能随之更新，变更后的内容将于正式公布后生效，如您已充分阅
                    读、理解并同意本协议，请您在页面点击确认或以其他方式确认</span>。您可随时在本产品的
                最新版本中查阅本协议，若您不同意变更后的协议内容，您有权停止使用本服务，若您
                继续使用本服务的，视为您同意接受变更后的协议内容。<span class="fb">如果您不接受变更后的协议内
                    容，请您立即停止本服务的使用</span>。
            </div>
            <div class="indent">
                为了保证您的使用体验和服务安全，本产品新版本发布后，<span class="fb">我司将使用公告、
                    弹窗或通知等方式提示您更新</span>，请您关注软件版本并及时进行更新。<span class="fb">我司建议您及时通
                    过我们的正规发布渠道更新和使用本产品最新版本</span>，避免因产品版本未更新等原因影响
                您的使用体验。
            </div>
            <div class="indent">
                本协议所规定的任何条款的部分或全部被中止、终止、撤销、无效者，不影响
                其它条款的效力。
            </div>
            <div class="indent">
                6.2本协议的解释、效力及纠纷的解决，适用于中华人民共和国法律。若您和我
                司之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，您在此完全同意将纠
                纷或争议提交我司所在地有管辖权的法院管辖。
            </div>
            <div class="indent">
                6.3本协议的生效和终止：
            </div>
            <div class="indent">
                本协议自您使用本产品之日起生效。
            </div>
            <div class="indent">
                本协议至您停止使用或因您违反法律法规或政策被停止提供本产品之日终止。
            </div>
            <div class="indent">
                6.4武汉富水数据技术有限公司保留对本协议的解释权。
            </div>
            <div class="indent">
                6.5本协议受中华人民共和国法律管辖。
            </div>
            <div class="bottom-text">
                武汉富水数据技术有限公司
            </div>
        </section>
    </div>
</template>
<script lang="ts">
    import {Component, Vue} from 'vue-property-decorator';

    @Component({
        asyncData() {
            return {
                // abc: 1
            };
        }
    })
    export default class extends Vue {
        mounted() {
        }
    }
</script>

<style lang="scss" scoped>
    .container {
        background-color: #fff;
        padding: 10px 35px;
    }

    .title {
        font-weight: bold;
        font-size: 40px;
        text-align: center;
        padding: 40px 0;
    }

    .sub-title {
        font-size: 28px;
        line-height: 1.5;
        margin-top: 35px;
        font-weight: bold;
    }

    .indent {
        text-indent: 40px;
        font-size: 25px;
        line-height: 1.5;
        margin-top: 15px;
        .bf{
            font-size: 25px;
        }
    }

    .fb {
        font-weight: bold;
    }

    .bold {
        font-size: 25px;
        line-height: 1.5;
        margin-top: 15px;
        font-weight: bold;
    }

    section {
        margin-bottom: 40px;
    }
    .bottom-text{
        text-align: right;
        font-size: 25px;
        line-height: 1.5;
        margin-top: 35px;
    }
</style>
